# OnlineSales.ai Assignment

## Task 1

Fetch top 3 departments along with their name and average monthly salary. Below is the format of the report

Answer:


select d.name as "DEPT_NAME",avg(s.amt) as "AVG_MONTHLY_SALARY(USD)" from employees as e join departments as d on e.dept_id=d.id join salaries as s on s.emp_id=e.id group by d.name order by avg(s.amt) desc limit 3;

## Task 2

In [1]:
import pandas as pd

In [2]:
departments=pd.read_csv("C:/Users/Merlin/Downloads/Departments.csv")

In [3]:
salaries=pd.read_csv("C:/Users/Merlin/Downloads/Salaries.csv")

In [4]:
employees=pd.read_csv("C:/Users/Merlin/Downloads/Employees.csv")

In [5]:
de=pd.merge(departments,employees,left_on='ID',right_on='DEPT ID')

In [6]:
combined=pd.merge(de,salaries,left_on='ID_y',right_on='EMP_ID')

In [7]:
combined

     ID_x NAME_x  ID_y   NAME_y  DEPT ID  EMP_ID  MONTH (YYYYMM)  AMT (USD)
0       1     HR     1     Jack        1       1          202207       5000
1       1     HR     1     Jack        1       1          202208       5000
2       1     HR     2     John        1       2          202207       4000
3       1     HR     2     John        1       2          202208       4000
4       1     HR    10  Shirley        1      10          202207       4800
..    ...    ...   ...      ...      ...     ...             ...        ...
166     5  Sales    16   Howard        5      16          202305       7500
167     5  Sales    16   Howard        5      16          202306       7500
168     5  Sales    21    Bruce        5      21          202304       4800
169     5  Sales    21    Bruce        5      21          202305       4800
170     5  Sales    21    Bruce        5      21          202306       4800

[171 rows x 8 columns]

In [8]:
avgamt=combined.groupby(['NAME_x'])['AMT (USD)'].mean()

In [9]:
avgamt

NAME_x
Finance    6360.317460
HR         5273.684211
IT         5839.393939
Ops        6420.000000
Sales      7045.161290
Name: AMT (USD), dtype: float64

In [11]:
ans=avgamt.sort_values(ascending=False).head(3)

In [12]:
ans

NAME_x
Sales      7045.16129
Ops        6420.00000
Finance    6360.31746
Name: AMT (USD), dtype: float64

## Task 3

Question: Given below is a Bash / Python script that performs following computation on an integer input (n):
If n is less than 10: Calculate its Square
Example: 4 => 16
If n is between 10 and 20: Calculate the factorial of (n-10)
Example: 15 => 120
If n is greater than 20: Calculate the sum of all integers between 1 and (n-20)
Example: 25 => 15

def compute(n):
    if n < 10:
        out = n ** 2
    elif n < 20:
        out = 1
        for i in range(1, n-10):
            out *= i
    else:
        lim = n - 20
        out = lim * lim
        out = out - lim
        out = out / 2 
    print(out)


n = int(input("Enter an integer: "))
compute(n)

Solution:

In [15]:
def compute(n):
    if n < 10:
        out = n ** 2
    elif n < 20:
        out = 1
        for i in range(1, n-9):
            out *= i
    else:
        lim = n - 20
        out = lim * lim
        out = out + lim
        out = out / 2 
    print(out)


n = int(input("Enter an integer: "))
compute(n)

Enter an integer: 6
36

In [16]:
n = int(input("Enter an integer: "))
compute(n)

Enter an integer: 16
720

In [17]:
n = int(input("Enter an integer: "))
compute(n)

Enter an integer: 35
120.0